Ribster/STM32-Projects/An Analog Datalogger REV A/include/projectconfig.h
/*
 * projectconfig.h
 *
 *  Created on: 12-apr.-2015
 *      Author: Robbe Van Assche
 */

#ifndef PROJECTCONFIG_PROJECT_H_
#define PROJECTCONFIG_PROJECT_H_

#include "stm32f4xx.h"
#include "stm32f4xx_gpio.h"
#include "stm32f4xx_rcc.h"

// general macro's
#define MIN(a,b) (((a)<(b))?(a):(b))
#define MAX(a,b) (((a)>(b))?(a):(b))


// Project version
#define PROJVER "0.0.001"

#define DBG
//#define DBGIO

// LEDS
/*
1	PE2	Output	GPIO_Output	LED0
2	PE3	Output	GPIO_Output	LED1
3	PE4	Output	GPIO_Output	LED2
4	PE5	Output	GPIO_Output	LED3
5	PE6	Output	GPIO_Output	LED4
*/

	enum ledList{
		ledList_White1,
		ledList_Blue,
		ledList_Orange,
		ledList_Green,
		ledList_White2
	};
	// White 1
	#define LED_PORT_0 GPIOE
	#define LED_PIN_0 2
	#define LED_MODE_0 GPIO_Mode_OUT
	#define LED_PULL_0 GPIO_PuPd_NOPULL
	#define LED_OTYPE_0 GPIO_OType_PP
	#define LED_SPEED_0 GPIO_Speed_100MHz
	#define LED_INITSTATE_0 Bit_RESET

	// Blue
	#define LED_PORT_1 GPIOE
	#define LED_PIN_1 3
	#define LED_MODE_1 GPIO_Mode_OUT
	#define LED_PULL_1 GPIO_PuPd_NOPULL
	#define LED_OTYPE_1 GPIO_OType_PP
	#define LED_SPEED_1 GPIO_Speed_100MHz
	#define LED_INITSTATE_1 Bit_RESET

	// Orange
	#define LED_PORT_2 GPIOE
	#define LED_PIN_2 4
	#define LED_MODE_2 GPIO_Mode_OUT
	#define LED_PULL_2 GPIO_PuPd_NOPULL
	#define LED_OTYPE_2 GPIO_OType_PP
	#define LED_SPEED_2 GPIO_Speed_100MHz
	#define LED_INITSTATE_2 Bit_RESET

	// Green
	#define LED_PORT_3 GPIOE
	#define LED_PIN_3 5
	#define LED_MODE_3 GPIO_Mode_OUT
	#define LED_PULL_3 GPIO_PuPd_NOPULL
	#define LED_OTYPE_3 GPIO_OType_PP
	#define LED_SPEED_3 GPIO_Speed_100MHz
	#define LED_INITSTATE_3 Bit_RESET

	// White 2
	#define LED_PORT_4 GPIOE
	#define LED_PIN_4 6
	#define LED_MODE_4 GPIO_Mode_OUT
	#define LED_PULL_4 GPIO_PuPd_NOPULL
	#define LED_OTYPE_4 GPIO_OType_PP
	#define LED_SPEED_4 GPIO_Speed_100MHz
	#define LED_INITSTATE_4 Bit_RESET


// PUSHBUTTONS
/*
 * 	62	PD15	I/O	GPIO_EXTI15	INPUT0
	61	PD14	I/O	GPIO_EXTI14	INPUT1
	60	PD13	I/O	GPIO_EXTI13	INPUT2
	59	PD12	I/O	GPIO_EXTI12	INPUT3
	58	PD11	I/O	GPIO_EXTI11	INPUT4
	57	PD10	I/O	GPIO_EXTI10	INPUT5
	*/
	#define PB_IT_IRQChannelPreemptionPriority 0x0F
	#define PB_IT_IRQChannelSubPriority 0x0F
	// UP
	#define PB_PORT_0 GPIOD
	#define PB_PIN_0 15
	#define PB_MODE_0 GPIO_Mode_IN
	#define PB_PULL_0 GPIO_PuPd_NOPULL
	#define PB_OTYPE_0 GPIO_OType_PP
	#define PB_SPEED_0 GPIO_Speed_100MHz
	#define PB_EXTI_Line_0 (1<<PB_PIN_0)

	// LEFT
	#define PB_PORT_1 GPIOD
	#define PB_PIN_1 14
	#define PB_MODE_1 GPIO_Mode_IN
	#define PB_PULL_1 GPIO_PuPd_NOPULL
	#define PB_OTYPE_1 GPIO_OType_PP
	#define PB_SPEED_1 GPIO_Speed_100MHz
	#define PB_EXTI_Line_1 (1<<PB_PIN_1)

	// MIDDLE
	#define PB_PORT_2 GPIOD
	#define PB_PIN_2 13
	#define PB_MODE_2 GPIO_Mode_IN
	#define PB_PULL_2 GPIO_PuPd_NOPULL
	#define PB_OTYPE_2 GPIO_OType_PP
	#define PB_SPEED_2 GPIO_Speed_100MHz
	#define PB_EXTI_Line_2 (1<<PB_PIN_2)

	// RIGHT
	#define PB_PORT_3 GPIOD
	#define PB_PIN_3 12
	#define PB_MODE_3 GPIO_Mode_IN
	#define PB_PULL_3 GPIO_PuPd_NOPULL
	#define PB_OTYPE_3 GPIO_OType_PP
	#define PB_SPEED_3 GPIO_Speed_100MHz
	#define PB_EXTI_Line_3 (1<<PB_PIN_3)

	// DOWN
	#define PB_PORT_4 GPIOD
	#define PB_PIN_4 11
	#define PB_MODE_4 GPIO_Mode_IN
	#define PB_PULL_4 GPIO_PuPd_NOPULL
	#define PB_OTYPE_4 GPIO_OType_PP
	#define PB_SPEED_4 GPIO_Speed_100MHz
	#define PB_EXTI_Line_4 (1<<PB_PIN_4)

	// ENTER
	#define PB_PORT_5 GPIOD
	#define PB_PIN_5 10
	#define PB_MODE_5 GPIO_Mode_IN
	#define PB_PULL_5 GPIO_PuPd_NOPULL
	#define PB_OTYPE_5 GPIO_OType_PP
	#define PB_SPEED_5 GPIO_Speed_100MHz
	#define PB_EXTI_Line_5 (1<<PB_PIN_5)



// ENCODERS
/*
63	PC6			I/O	TIM8_CH1	ENC1_A
64	PC7			I/O	TIM8_CH2	ENC1_B
23	PA0-WKUP	I/O	TIM2_CH1	ENC2_A
24	PA1			I/O	TIM2_CH2	ENC2_B
	*/
#define ENC_1_TIMER TIM8
	// CHAN A
	#define ENC_1_A_PORT GPIOC
	#define ENC_1_A_PIN 6
	#define ENC_1_A_MODE GPIO_Mode_AF
	#define ENC_1_A_PULL GPIO_PuPd_NOPULL
	#define ENC_1_A_OTYPE GPIO_OType_PP
	#define ENC_1_A_SPEED GPIO_Speed_100MHz
	#define ENC_1_A_AF GPIO_AF_TIM8 //AF3
	// CHAN B
	#define ENC_1_B_PORT GPIOC
	#define ENC_1_B_PIN 7
	#define ENC_1_B_MODE GPIO_Mode_AF
	#define ENC_1_B_PULL GPIO_PuPd_NOPULL
	#define ENC_1_B_OTYPE GPIO_OType_PP
	#define ENC_1_B_SPEED GPIO_Speed_100MHz
	#define ENC_1_B_AF GPIO_AF_TIM8 //AF3

#define ENC_2_TIMER TIM5
	// CHAN A
	#define ENC_2_A_PORT GPIOA
	#define ENC_2_A_PIN 0
	#define ENC_2_A_MODE GPIO_Mode_AF
	#define ENC_2_A_PULL GPIO_PuPd_NOPULL
	#define ENC_2_A_OTYPE GPIO_OType_PP
	#define ENC_2_A_SPEED GPIO_Speed_100MHz
	#define ENC_2_A_AF GPIO_AF_TIM5 //AF2
	// CHAN B
	#define ENC_2_B_PORT GPIOA
	#define ENC_2_B_PIN 1
	#define ENC_2_B_MODE GPIO_Mode_AF
	#define ENC_2_B_PULL GPIO_PuPd_NOPULL
	#define ENC_2_B_OTYPE GPIO_OType_PP
	#define ENC_2_B_SPEED GPIO_Speed_100MHz
	#define ENC_2_B_AF GPIO_AF_TIM5 //AF2

// BATTERY MANAGEMENT
/*
25	PA2	I/O	ADC1_IN2	BATVOLTAGE
*/
#define BATVOLTAGE_PORT GPIOA
#define BATVOLTAGE_PIN 2
#define BATVOLTAGE_MODE GPIO_Mode_AN
#define BATVOLTAGE_PULL GPIO_PuPd_NOPULL
#define BATVOLTAGE_OTYPE GPIO_OType_PP
#define BATVOLTAGE_SPEED GPIO_Speed_100MHz

// AFE
	/*
29	PA4	I/O		SPI1_NSS	AFE_CS
33	PC4	Output	GPIO_Output	AFE_INT
31	PA6	I/O		SPI1_MISO	AFE_MISO
32	PA7	I/O		SPI1_MOSI	AFE_MOSI
30	PA5	I/O		SPI1_SCK	AFE_SCK
34	PC5	I/O		GPIO_EXTI5	AFE_SYNC1
35	PB0	I/O		GPIO_EXTI0	AFE_SYNC2
36	PB1	I/O		GPIO_EXTI1	AFE_SYNC3
38	PE7	I/O		GPIO_EXTI7	EXT_SYNC
	 */
#define AFE_SPI SPI1
#define AFE_SPI_IRQn SPI1_IRQn
#define AFE_DMA_BufferSize 512
	// SPI Config
		#define AFE_SPI_Direction SPI_Direction_2Lines_FullDuplex
		#define AFE_SPI_Mode SPI_Mode_Slave
		#define AFE_SPI_DataSize SPI_DataSize_8b
		#define AFE_SPI_CPOL SPI_CPOL_Low
		#define AFE_SPI_CPHA SPI_CPHA_1Edge
		#define AFE_SPI_NSS SPI_NSS_Soft
		#define AFE_SPI_BaudRatePrescaler SPI_BaudRatePrescaler_16
		#define AFE_SPI_FirstBit SPI_FirstBit_MSB
		#define AFE_SPI_CRCPolynomial 7
	// DMA SPI from Memory 2 Peripheral
		// TX STREAM
		#define AFE_DMA_TX_DMAStream DMA2_Stream3
		#define AFE_DMA_TX_DMAIRQ DMA2_Stream3_IRQn
		#define AFE_DMA_TX_DMAChannel DMA_Channel_3
		#define AFE_DMA_TX_TransferCompleteFlag DMA_FLAG_TCIF3
		#define AFE_DMA_TX_TransferHalfCompleteFlag DMA_FLAG_HTIF3
		#define AFE_DMA_TX_DMARequest SPI_I2S_DMAReq_Tx
		#define AFE_DMA_TX_DIR DMA_DIR_MemoryToPeripheral

		// RX STREAM
		#define AFE_DMA_RX_DMAStream DMA2_Stream2
		#define AFE_DMA_RX_DMAIRQ DMA2_Stream2_IRQn
		#define AFE_DMA_RX_DMAChannel DMA_Channel_3
		#define AFE_DMA_RX_TransferCompleteFlag DMA_FLAG_TCIF2
		#define AFE_DMA_RX_TransferHalfCompleteFlag DMA_FLAG_HTIF2
		#define AFE_DMA_RX_DMARequest SPI_I2S_DMAReq_Rx
		#define AFE_DMA_RX_DIR DMA_DIR_PeripheralToMemory

		#define AFE_DMA_PeripheralBaseAddr (uint32_t)(&(AFE_SPI->DR))
		//#define AFE_DMA_Memory0BaseAddr //heap pointer
		#define AFE_DMA_PeripheralInc DMA_PeripheralInc_Disable
		#define AFE_DMA_MemoryInc DMA_MemoryInc_Enable
		#define AFE_DMA_PeripheralDataSize DMA_PeripheralDataSize_Byte
		#define AFE_DMA_MemoryDataSize DMA_MemoryDataSize_Byte
		#define AFE_DMA_Mode DMA_Mode_Normal
		#define AFE_DMA_Priority DMA_Priority_High
		#define AFE_DMA_FIFOMode DMA_FIFOMode_Disable
		#define AFE_DMA_FIFOThreshold DMA_FIFOThreshold_Full
		#define AFE_DMA_MemoryBurst DMA_MemoryBurst_Single
		#define AFE_DMA_PeripheralBurst DMA_PeripheralBurst_Single

