Ribster/STM32-Projects/An Analog Datalogger REV A/include/projectconfig.h
	// INTERRUPT PIN
	#define AFE_INT_PORT GPIOC
	#define AFE_INT_PIN 4
	#define AFE_INT_MODE GPIO_Mode_OUT
	#define AFE_INT_PULL GPIO_PuPd_UP
	#define AFE_INT_OTYPE GPIO_OType_PP
	#define AFE_INT_SPEED GPIO_Speed_100MHz
	#define AFE_INT_INITSTATE Bit_SET
	// CHIPSELECT PIN
	#define AFE_CS_PORT GPIOA
	#define AFE_CS_PIN 4
	#define AFE_CS_MODE GPIO_Mode_OUT
	#define AFE_CS_PULL GPIO_PuPd_UP
	#define AFE_CS_OTYPE GPIO_OType_OD
	#define AFE_CS_SPEED GPIO_Speed_100MHz
	#define AFE_CS_INITSTATE Bit_SET
	// MISO PIN
	#define AFE_MISO_PORT GPIOA
	#define AFE_MISO_PIN 6
	#define AFE_MISO_MODE GPIO_Mode_AF
	#define AFE_MISO_PULL GPIO_PuPd_DOWN
	#define AFE_MISO_OTYPE GPIO_OType_PP
	#define AFE_MISO_SPEED GPIO_Speed_100MHz
	#define AFE_MISO_AF GPIO_AF_SPI1 //AF5
	// MOSI PIN
	#define AFE_MOSI_PORT GPIOA
	#define AFE_MOSI_PIN 7
	#define AFE_MOSI_MODE GPIO_Mode_AF
	#define AFE_MOSI_PULL GPIO_PuPd_DOWN
	#define AFE_MOSI_OTYPE GPIO_OType_PP
	#define AFE_MOSI_SPEED GPIO_Speed_100MHz
	#define AFE_MOSI_AF GPIO_AF_SPI1 //AF5
	// SCK PIN
	#define AFE_SCK_PORT GPIOA
	#define AFE_SCK_PIN 5
	#define AFE_SCK_MODE GPIO_Mode_AF
	#define AFE_SCK_PULL GPIO_PuPd_DOWN
	#define AFE_SCK_OTYPE GPIO_OType_PP
	#define AFE_SCK_SPEED GPIO_Speed_100MHz
	#define AFE_SCK_AF GPIO_AF_SPI1 //AF5
	// SYNC1 PIN
	#define AFE_SYNC1_PORT GPIOC
	#define AFE_SYNC1_PIN 5
	#define AFE_SYNC1_MODE GPIO_Mode_OUT
	#define AFE_SYNC1_PULL GPIO_PuPd_NOPULL
	#define AFE_SYNC1_OTYPE GPIO_OType_PP
	#define AFE_SYNC1_SPEED GPIO_Speed_100MHz
	#define AFE_SYNC1_INITSTATE Bit_RESET
	// SYNC2 PIN
	#define AFE_SYNC2_PORT GPIOB
	#define AFE_SYNC2_PIN 0
	#define AFE_SYNC2_MODE GPIO_Mode_IN
	#define AFE_SYNC2_PULL GPIO_PuPd_NOPULL
	#define AFE_SYNC2_OTYPE GPIO_OType_PP
	#define AFE_SYNC2_SPEED GPIO_Speed_100MHz
	#define AFE_SYNC2_EXTI_Line (1<<AFE_SYNC2_PIN)
	// SYNC3 PIN
	#define AFE_SYNC3_PORT GPIOB
	#define AFE_SYNC3_PIN 1
	#define AFE_SYNC3_MODE GPIO_Mode_IN
	#define AFE_SYNC3_PULL GPIO_PuPd_NOPULL
	#define AFE_SYNC3_OTYPE GPIO_OType_PP
	#define AFE_SYNC3_SPEED GPIO_Speed_100MHz
	#define AFE_SYNC3_EXTI_Line (1<<AFE_SYNC3_PIN)
	// EXTERNAL SYNC PIN
	#define AFE_EXT_SYNC_PORT GPIOE
	#define AFE_EXT_SYNC_PIN 7
	#define AFE_EXT_SYNC_MODE GPIO_Mode_IN
	#define AFE_EXT_SYNC_PULL GPIO_PuPd_NOPULL
	#define AFE_EXT_SYNC_OTYPE GPIO_OType_PP
	#define AFE_EXT_SYNC_SPEED GPIO_Speed_100MHz
	#define AFE_EXT_SYNC_EXTI_Line (1<<AFE_EXT_SYNC_PIN)

// nRF
/*
56	PD9	Output	GPIO_Output	nRF_CE
55	PD8		I/O	GPIO_EXTI8	nRF_IRQ
53	PB14	I/O	SPI2_MISO	nRF_MISO
54	PB15	I/O	SPI2_MOSI	nRF_MOSI
52	PB13	I/O	SPI2_SCK	nRF_SCK
51	PB12	I/O	SPI2_NSS	nRF_SS
	*/
#define nRF_SPI SPI2

// SPI Config
	#define nRF_SPI_Direction SPI_Direction_2Lines_FullDuplex
	#define nRF_SPI_Mode SPI_Mode_Master
	#define nRF_SPI_DataSize SPI_DataSize_8b
	#define nRF_SPI_CPOL SPI_CPOL_Low
	#define nRF_SPI_CPHA SPI_CPHA_1Edge
	#define nRF_SPI_NSS SPI_NSS_Soft
	#define nRF_SPI_BaudRatePrescaler SPI_BaudRatePrescaler_4
	#define nRF_SPI_FirstBit SPI_FirstBit_MSB
	#define nRF_SPI_CRCPolynomial 7

	#define nRF_CE_PORT GPIOD
	#define nRF_CE_PIN 9
	#define nRF_CE_MODE GPIO_Mode_OUT
	#define nRF_CE_PULL GPIO_PuPd_NOPULL
	#define nRF_CE_OTYPE GPIO_OType_PP
	#define nRF_CE_SPEED GPIO_Speed_100MHz
	#define nRF_CE_INITSTATE Bit_RESET

	#define nRF_IRQ_PORT GPIOD
	#define nRF_IRQ_PIN 8
	#define nRF_IRQ_MODE GPIO_Mode_IN
	#define nRF_IRQ_PULL GPIO_PuPd_NOPULL
	#define nRF_IRQ_OTYPE GPIO_OType_PP
	#define nRF_IRQ_SPEED GPIO_Speed_100MHz
	#define nRF_IRQ_EXTI_Line (1<<nRF_IRQ_PIN)

	#define nRF_MISO_PORT GPIOB
	#define nRF_MISO_PIN 14
	#define nRF_MISO_MODE GPIO_Mode_AF
	#define nRF_MISO_PULL GPIO_PuPd_NOPULL
	#define nRF_MISO_OTYPE GPIO_OType_PP
	#define nRF_MISO_SPEED GPIO_Speed_100MHz
	#define nRF_MISO_AF GPIO_AF_SPI2 //AF5

	#define nRF_MOSI_PORT GPIOB
	#define nRF_MOSI_PIN 15
	#define nRF_MOSI_MODE GPIO_Mode_AF
	#define nRF_MOSI_PULL GPIO_PuPd_NOPULL
	#define nRF_MOSI_OTYPE GPIO_OType_PP
	#define nRF_MOSI_SPEED GPIO_Speed_100MHz
	#define nRF_MOSI_AF GPIO_AF_SPI2 //AF5

	#define nRF_SCK_PORT GPIOB
	#define nRF_SCK_PIN 13
	#define nRF_SCK_MODE GPIO_Mode_AF
	#define nRF_SCK_PULL GPIO_PuPd_NOPULL
	#define nRF_SCK_OTYPE GPIO_OType_PP
	#define nRF_SCK_SPEED GPIO_Speed_100MHz
	#define nRF_SCK_AF GPIO_AF_SPI2 //AF5

	#define nRF_SS_PORT GPIOB
	#define nRF_SS_PIN 12
	#define nRF_SS_MODE GPIO_Mode_OUT
	#define nRF_SS_PULL GPIO_PuPd_NOPULL
	#define nRF_SS_OTYPE GPIO_OType_PP
	#define nRF_SS_SPEED GPIO_Speed_100MHz
	#define nRF_SS_INITSTATE Bit_RESET

// OLED
/*
92	PB6	Output	GPIO_Output	OLED_MOSI
91	PB5	I/O		SPI3_MOSI	OLED_MOSI
93	PB7	Output	GPIO_Output	OLED_RST
89	PB3	I/O		SPI3_SCK	OLED_SCK
95	PB8	Output	GPIO_Output	OLED_SS
	*/
#define OLED_SPI SPI3
// Perspective of sizes is landscape orientation
	#define OLED_HEIGHT 64
	#define OLED_WIDTH 128
	#define OLED_BufferSize (OLED_HEIGHT*OLED_WIDTH/8)
	#define OLED_EXTERNALVCC Bit_RESET
	#define OLED_ORIENTATION SSD1306_ORIENTATION_LANDSCAPE_UpsideDown
	//#define OLED_ORIENTATION SSD1306_ORIENTATION_PORTRAIT_CCW
	#define OLED_VIEWMODE SSD1306_VIEWMODE_NORMAL
// SPI Config
	#define OLED_SPI_Direction SPI_Direction_1Line_Tx
	#define OLED_SPI_Mode SPI_Mode_Master
	#define OLED_SPI_DataSize SPI_DataSize_8b
	#define OLED_SPI_CPOL SPI_CPOL_Low
	#define OLED_SPI_CPHA SPI_CPHA_1Edge
	#define OLED_SPI_NSS SPI_NSS_Soft
	#define OLED_SPI_BaudRatePrescaler SPI_BaudRatePrescaler_2
	#define OLED_SPI_FirstBit SPI_FirstBit_MSB
	#define OLED_SPI_CRCPolynomial 7
// DMA SPI from Memory 2 Peripheral
	#define OLED_DMA_TX_DMAStream DMA1_Stream7
	#define OLED_DMA_TX_DMAChannel DMA_Channel_0
	#define OLED_DMA_TX_TransferCompleteFlag DMA_FLAG_TCIF7
	#define OLED_DMA_TX_DMARequest SPI_I2S_DMAReq_Tx
	#define OLED_DMA_PeripheralBaseAddr (uint32_t)&(OLED_SPI->DR)
//#define OLED_DMA_Memory0BaseAddr //heap pointer
	#define OLED_DMA_TX_DIR DMA_DIR_MemoryToPeripheral
	#define OLED_DMA_PeripheralInc DMA_PeripheralInc_Disable
	#define OLED_DMA_MemoryInc DMA_MemoryInc_Enable
	#define OLED_DMA_PeripheralDataSize DMA_PeripheralDataSize_Byte
	#define OLED_DMA_MemoryDataSize DMA_MemoryDataSize_Byte
	#define OLED_DMA_Mode DMA_Mode_Normal
	#define OLED_DMA_Priority DMA_Priority_High
	#define OLED_DMA_FIFOMode DMA_FIFOMode_Disable
	#define OLED_DMA_FIFOThreshold DMA_FIFOThreshold_1QuarterFull
	#define OLED_DMA_MemoryBurst DMA_MemoryBurst_Single
	#define OLED_DMA_PeripheralBurst DMA_PeripheralBurst_Single

// Refresh timer
	#define OLED_TIMER TIM13 /* Timer used for auto refresh interrupt */
	#define OLED_TIMER_ITFlag TIM_IT_Update
	#define OLED_TIMER_IRQn TIM8_UP_TIM13_IRQn
	// DC PIN
	#define OLED_DC_PORT GPIOB
	#define OLED_DC_PIN 6
	#define OLED_DC_MODE GPIO_Mode_OUT
	#define OLED_DC_PULL GPIO_PuPd_NOPULL
	#define OLED_DC_OTYPE GPIO_OType_PP
	#define OLED_DC_SPEED GPIO_Speed_100MHz
	#define OLED_DC_INITSTATE Bit_RESET
	// MOSI PIN
	#define OLED_MOSI_PORT GPIOB
	#define OLED_MOSI_PIN 5
	#define OLED_MOSI_MODE GPIO_Mode_AF
	#define OLED_MOSI_PULL GPIO_PuPd_DOWN
	#define OLED_MOSI_OTYPE GPIO_OType_PP
	#define OLED_MOSI_SPEED GPIO_Speed_100MHz
	#define OLED_MOSI_AF GPIO_AF_SPI3 //AF6
	// RST PIN
	#define OLED_RST_PORT GPIOB
	#define OLED_RST_PIN 7
	#define OLED_RST_MODE GPIO_Mode_OUT
	#define OLED_RST_PULL GPIO_PuPd_NOPULL
	#define OLED_RST_OTYPE GPIO_OType_PP
	#define OLED_RST_SPEED GPIO_Speed_100MHz
	#define OLED_RST_INITSTATE Bit_RESET
	// SCK PIN
	#define OLED_SCK_PORT GPIOB
	#define OLED_SCK_PIN 3
	#define OLED_SCK_MODE GPIO_Mode_AF
	#define OLED_SCK_PULL GPIO_PuPd_DOWN
	#define OLED_SCK_OTYPE GPIO_OType_PP
	#define OLED_SCK_SPEED GPIO_Speed_100MHz
	#define OLED_SCK_AF GPIO_AF_SPI3 //AF6
	// SS PIN
	#define OLED_SS_PORT GPIOB
	#define OLED_SS_PIN 8
	#define OLED_SS_MODE GPIO_Mode_OUT
	#define OLED_SS_PULL GPIO_PuPd_NOPULL
	#define OLED_SS_OTYPE GPIO_OType_PP
	#define OLED_SS_SPEED GPIO_Speed_100MHz
	#define OLED_SS_INITSTATE Bit_RESET

// USB
/*
70	PA11	I/O	USB_OTG_FS_DM
71	PA12	I/O	USB_OTG_FS_DP
69	PA10	I/O	USB_OTG_FS_ID
*/
	#define USB_DM_PORT GPIOA
	#define USB_DM_PIN 11
	#define USB_DM_MODE GPIO_Mode_AF
	#define USB_DM_PULL GPIO_PuPd_NOPULL
	#define USB_DM_OTYPE GPIO_OType_PP
	#define USB_DM_SPEED GPIO_Speed_100MHz
	#define USB_DM_AF GPIO_AF_OTG_FS //AF10

	#define USB_DP_PORT GPIOA
	#define USB_DP_PIN 12
	#define USB_DP_MODE GPIO_Mode_AF
	#define USB_DP_PULL GPIO_PuPd_NOPULL
	#define USB_DP_OTYPE GPIO_OType_PP
	#define USB_DP_SPEED GPIO_Speed_100MHz
	#define USB_DP_AF GPIO_AF_OTG_FS //AF10

	#define USB_ID_PORT GPIOA
	#define USB_ID_PIN 10
	#define USB_ID_MODE GPIO_Mode_AF
	#define USB_ID_PULL GPIO_PuPd_NOPULL
	#define USB_ID_OTYPE GPIO_OType_PP
	#define USB_ID_SPEED GPIO_Speed_100MHz
	#define USB_ID_AF GPIO_AF_OTG_FS //AF10

