Ribster/STM32-Projects/An Analog Datalogger REV A/include/projectconfig.h
#define TESTPOINT_4_PORT GPIOE
#define TESTPOINT_4_PIN 0
#define TESTPOINT_4_MODE GPIO_Mode_OUT
#define TESTPOINT_4_PULL GPIO_PuPd_NOPULL
#define TESTPOINT_4_OTYPE GPIO_OType_PP
#define TESTPOINT_4_SPEED GPIO_Speed_100MHz
#define TESTPOINT_4_INITSTATE Bit_RESET

#define TESTPOINT_5_PORT GPIOE
#define TESTPOINT_5_PIN 1
#define TESTPOINT_5_MODE GPIO_Mode_OUT
#define TESTPOINT_5_PULL GPIO_PuPd_NOPULL
#define TESTPOINT_5_OTYPE GPIO_OType_PP
#define TESTPOINT_5_SPEED GPIO_Speed_100MHz
#define TESTPOINT_5_INITSTATE Bit_RESET

#define TESTPOINT_6_PORT GPIOB
#define TESTPOINT_6_PIN 4
#define TESTPOINT_6_MODE GPIO_Mode_OUT
#define TESTPOINT_6_PULL GPIO_PuPd_NOPULL
#define TESTPOINT_6_OTYPE GPIO_OType_PP
#define TESTPOINT_6_SPEED GPIO_Speed_100MHz
#define TESTPOINT_6_INITSTATE Bit_RESET

#define TESTPOINT_7_PORT GPOIB
#define TESTPOINT_7_PIN 9
#define TESTPOINT_7_MODE GPIO_Mode_OUT
#define TESTPOINT_7_PULL GPIO_PuPd_NOPULL
#define TESTPOINT_7_OTYPE GPIO_OType_PP
#define TESTPOINT_7_SPEED GPIO_Speed_100MHz
#define TESTPOINT_7_INITSTATE Bit_RESET

#define TESTPOINT_8_PORT GPIOD
#define TESTPOINT_8_PIN 0
#define TESTPOINT_8_MODE GPIO_Mode_OUT
#define TESTPOINT_8_PULL GPIO_PuPd_NOPULL
#define TESTPOINT_8_OTYPE GPIO_OType_PP
#define TESTPOINT_8_SPEED GPIO_Speed_100MHz
#define TESTPOINT_8_INITSTATE Bit_RESET

#define TESTPOINT_9_PORT GPIOD
#define TESTPOINT_9_PIN 1
#define TESTPOINT_9_MODE GPIO_Mode_OUT
#define TESTPOINT_9_PULL GPIO_PuPd_NOPULL
#define TESTPOINT_9_OTYPE GPIO_OType_PP
#define TESTPOINT_9_SPEED GPIO_Speed_100MHz
#define TESTPOINT_9_INITSTATE Bit_RESET

#define TESTPOINT_10_PORT GPIOD
#define TESTPOINT_10_PIN 7
#define TESTPOINT_10_MODE GPIO_Mode_OUT
#define TESTPOINT_10_PULL GPIO_PuPd_NOPULL
#define TESTPOINT_10_OTYPE GPIO_OType_PP
#define TESTPOINT_10_SPEED GPIO_Speed_100MHz
#define TESTPOINT_10_INITSTATE Bit_RESET

#define TESTPOINT_11_PORT GPIOD
#define TESTPOINT_11_PIN 3
#define TESTPOINT_11_MODE GPIO_Mode_OUT
#define TESTPOINT_11_PULL GPIO_PuPd_NOPULL
#define TESTPOINT_11_OTYPE GPIO_OType_PP
#define TESTPOINT_11_SPEED GPIO_Speed_100MHz
#define TESTPOINT_11_INITSTATE Bit_RESET

#define TESTPOINT_12_PORT GPIOD
#define TESTPOINT_12_PIN 4
#define TESTPOINT_12_MODE GPIO_Mode_OUT
#define TESTPOINT_12_PULL GPIO_PuPd_NOPULL
#define TESTPOINT_12_OTYPE GPIO_OType_PP
#define TESTPOINT_12_SPEED GPIO_Speed_100MHz
#define TESTPOINT_12_INITSTATE Bit_RESET

// UNUSED PINS

#endif /* PROJECTCONFIG_H_ */
